Repository: mozilla-l10n/mt-training-data
Catalog: luo/luo_pontoon.tmx
Source language: en_us
Languages: luo

source: If you think the pronunciation makes it <strong>impossible to understand</strong>, or there’s a <strong>lot of background noise</strong>, or there are <strong>other people speaking too</strong>, then you should reject the clip. <accuracyLink>See more information in our accuracy criteria</accuracyLink>.
luo: Kiparo ni kaka osom wechego miyo <strong> wechego bedo matek ng'eyo</strong>, kata kaponi nitie <strong> koko mangeny mawinjore </strong>, kata ka nitie <strong>jomoko wuoyo be</strong>, to ikwayo mondo iwed duol momakno. <accuracyLink> Som mangeny kuom puonjruok mawaketo kanyo mar lony madwarore</accuracyLink>

source: Igbo
luo: Dhoigbo

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
luo: An kare gi mulo wachni kaka uwache e chike mag weche mopondo mag Mozilla

source: Indonesian
luo: Dhoindonesia

source: Information about the language
luo: Weche mawuoyo kuom dhok

source: In Progress
luo: Madhi nyime

source: Interested in learning more and contributing to the project?
luo: In kod dwaro mar puonjori mangeny kendo chiwo ne migawoni?

source: Interlingua
luo: Dhok molosi kaluwore gi weche mogol e dho kisungu maji jotiyogo ahinya. kendo dhokni inyalo tigo e puonjruok mar masinde￼Type

source: Interlingue
luo: Dhointalingua

source: Intersex
luo: Kido mar ngama ok dichuo kata dhako

source: Irish
luo: Dhoiris

source: IsiNdebele (North)
luo: Dhoisindebele ma nyanduat

source: IsiNdebele (South)
luo: Dhoisindebele ma milambo

source: Is my account information public?
luo: Be ni weche mag akaont mara nie ayanga?

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
luo: <isoCodeLink>Nembni mag ISO</isoCodeLink> kongere

source: Is the clip valid?
luo: Be duol momakino ni kare?

source: Is the goal of Common Voice to build a voice assistant?
luo: Dibed ni dwaro mar Common Voice en ni oger jakony mar wuoyo?

source: Italian
luo: Dhoitali

source: It contains words or phrases that are hard to read or pronounce.
luo: Otingo weche matek somo kendo wacho

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
luo: Bende ingeyoni en machiegni dola million e yiga mondo okan deche e chenroni kendo mondo chenroni oting dhoudi mokalo mia achiel matiyogi kode?

source: It is written in a language different than what I’m reviewing.
luo: Ondike kod dhok mopogore kod manono.

source: It is written in a language different than what I’m speaking.
luo: Ondikgi e dhok mopogore kod mawawacho

source: Izhorian
luo: Dhoizoria

source: Japanese
luo: Dhojapan

source: Javanese
luo: Dhojavanese

source: Join the Common Voice mailing list
luo: Donji e kanyakla mayudo barupe mawuok Common Voice

source: Just Unsure?
luo: Ok an kod adieri

source: Kabardian
luo: Dhokabadia

source: Kabyle
luo: Dhokabile

source: Kannada
luo: Dhokannada

source: Kaqchikel
luo: dhogwatamala

source: Karakalpak
luo: Dhokarakalpak

source: Kazakh
luo: Dhokaza

source: { $kb }kb max
luo: { $kb }kb moromo

source: Keep
luo: Kan

source: Keep it up, record again <recordIcon></recordIcon>
luo: Itimo maber, mak duondi kendo <recordIcon></recordIcon>

source: Keep the recordings
luo: Kan duondego

source: Keep track of your progress and metrics across multiple languages.
luo: Yie ilim dongruok mari kaluwore kod tich misetimo e dhok mopogore opogore.

source: Keep track of your progress with a profile
luo: Nge kuma isechopo gi tich kod akaunt

source: Keep track of your progress with a profile and help our voice data be more accurate.
luo: Inyalo ngiyo kaka itiyo kibedo gi kalatas mawuoyo kuomi to be ikonyo deche duol momaki bedo makare.

source: Khmer
luo: Dhokmer

source: K'iche'
luo: Dhokiche

source: Kichwa
luo: wich

source: Kikuyu
luo: Dhokikuyu

source: Kinyarwanda
luo: Dhokinyarwanda

source: Komi-Zyrian
luo: Dhokomi-Siria

source: Konkani (Devanagari)
luo: Dhokonkani

source: Korean
luo: Dhokorea

source: Kurmanji Kurdish
luo: Dhokemanji ma Kudis

source: Kyrgyz
luo: Dhokigi

source: Language
luo: Dhok

source: Language Request
luo: Dhok Midwaro

source: Language request successfully submitted, thank you.
luo: Kwayo dhok osechopo maber, erokamo.

source: Languages
luo: Dhok

source: Lao
luo: Dholao

source: Latgalian
luo: Dholagalia

source: Latvian
luo: Dholatvia

source: Launched
luo: Osechaki

source: Laz
luo: Dholaz

source: Leaderboard Visibility
luo: Ranyisi jomatiyo matek

source: Learn how to take part
luo: Puojri kaka inyalo betie achiel

source: Learn More
luo: Med puonjori

source: Leaving now means you’ll lose your changes
luo: wuok sani biro miyo lokruok miseketo lal

source: Leaving now means you'll lose your progress
luo: Wuok sani tiendeni ibiro lalo tich misetimo

source: Length
luo: Bor

source: Let's Get Started
luo: Wachakuru

source: License
luo: Chik tich

source: License: <licenseLink>CC-0</licenseLink>
luo: Chik: <licenseLink>CC-0</licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
luo: Otas mar rusa:<licenseLink>{ $license }</licenseLink>

source: Ligurian
luo: Dholiguria

source: Lingala
luo: Dholingala

source: Link Copied
luo: Weche moyudore osekopi

source: Listen
luo: Winji

source: Listening
luo: Chiko it

source: Listen-Queue
luo: Riedo mar chiko it

source: Lithuanian
luo: Dholithuania

source: Loading…
luo: Donjo

source: Loading rejected sentences…
luo: Kelo weche motamruok...

source: Loading your sentences…
luo: Wechegi biro...

source: Localization
luo: Loko dho chenro

source: Localized
luo: Oseketgi e alworagi

source: Log In
luo: Donji

source: Login failed
luo: Donjo otamore.

source: Login Identity
luo: Nying mafwenyo ng'ato

source: Log in or sign up to get started
luo: Donji kaa ndikri mondo ichaki

source: Login / Signup
luo: donjo e komputa

source: Log In / Sign Up
luo: Donji

source: Logout
luo: Wuog oko

source: Log Out
luo: Wuogi

source: Lojban
luo: Dholoban

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
luo: Nenoreni ni onge sani weche momaki mangato nyalo chikone ite. Yie ikonywa pongo laini kod mako duondi sani.

source: Luganda
luo: Dholuganda

source: Luxembourgish
luo: Dholuksenbag

source: Macedonian
luo: Dhomasedonia

source: Maithili
luo: Dhomaithili

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
luo: Tem ingi ni chenro mako duol kapok ichako mako duondi, kendo chenro kik chung kapok itieko.

source: Make sure the sentence meets the following criteria:
luo: Ngiyanena ni wechego oluwo chenro mochiew

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
luo: Or wecheni mochanoreno to kik iket nyingi kata higa mari ok dwar ni mago ofweny

source: Malagasy
luo: Dhomalagasi

source: Malay
luo: Dhomalai

source: Malayalam
luo: Dhomalayalam

source: Male
luo: Dichuo

source: Male/Masculine
luo: Dichuo/kido mar dichuo

source: Maltese
luo: Dhomalta

source: Manage Email Subscriptions
luo: Pang barup mbui mosechiu

source: Manage Subscriptions
luo: Tayo chiwo

source: Mapudungun
luo: Dhopudungun

source: Marathi
luo: Dhomarathi

source: Meadow Mari
luo: Dhomido ma Mari

source: Medumba
luo: Dhomedumba

source: Meetei Lon
luo: Dhomeetai ma Lon

source: Message
luo: Wach

source: [Mismatched content]
luo: [Weche ma ok owinjore]

source: Misreadings
luo: Ma okosom maber

source: Missing an <strong>'s'</strong> at the end of a word.
luo: Onge <strong>'s</strong> e 'giko wach

source: Mixed
luo: Onywandore/oriwore

source: Moksha
luo: Dhomosha

source: Mongolian
luo: Dhomongolia

source: More
luo: Mangeny moloyo

source: Mossi
luo: Dhomossi

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
luo: Thoth weche ma kembe madongo tiyogo sani ok yudre mayot ne jiduto madwaro tiyo kodgi. Waparo ni wachni thiro dongurok. Emomiyo waloso chenro miluongo ni Commom Voice, ma en chenro moket ni mondo okony loso teknologi matiyo gi duol ochop ne jiduto.

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
luo: Thoth weche ma kembe madongo tiyogo sani ok yudre mayot ne jiduto madwaro tiyo kodgi. Waparo ni wachni thiro dongurok. Emomiyo waloso chenro miluongo ni Commom Voice, ma en chenro moket ni mondo okony loso teknologi matiyo gi duol ochop ne jiduto.

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
luo: Ngeny deche mag duol ok nigi duonde motingo ji duto, ngeny duonde gin mag <articleLink>jomachuo kod jomanigi pesa</articleLink>. Kabind duonde gi dhok maonge e deche gi gin mag jomaok nyal konyore kendgi. Ngeny teknoloji mag dunde ok nyal poge duond jomamine maber. Emomiyo wadwaro kabind dwonde mopogore opogore e deche wa mag duol.

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
luo: Mozilla Commin Voice en chenro mar konyo masinde kaka dhano wuoyo.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
luo: Mozila oyangore ne kano weche kendo miyo ji duto thuolo mayot mar yudo wechegi. Mondo gitim mano, gidwaro tiego jo nonro mag mbui kokadho kuom Common Voice. Kaka weche mag dongruok mag duol medo landore kendo kadho kuonde mane ong'ere nitiye kodgi, wan gi geno ni ji duto nyaka yud konyruok marom. Mano tiende ni nyaka koro ter nyalo kuom dhok mamoko kendo rwako lep mopogore kod kwan mar oganda e seche migero kendo itemo nonro mar teknoloji mar duol. Common Voice en mwandu mar oganda mar ng'ato ang'ata kendo grube mag Mozilla kod jok magere e piny ngima osechako tiyo kode e chenro maggi.

source: Mutual accountability.
luo: Ngado bura mar ji duto.

source: My Sentences
luo: wechega / wechena

source: N/A
luo: Ok dwarre

source: Name
luo: Nying

source: Names of your language
luo: Nyinge mag dhou

source: Native Language
luo: Dhowa

source: Need help with the Sex or Gender changes?
luo: Idwaro kony loko weche mag kit ngato kaka dichuo kata dhako?

source: Need some help with accent?
luo: Idwaro kony kod kabind duol?

source: Need some help with variants?
luo: Idwaro kony kod mopogore opogore?

source: Need to download your data?
luo: Idwaro golo wecheni?

source: Nepali
luo: Dhonepali

source: New Language Launch
luo: Chako dhok mayien

source: Next
luo: Machielo

source: Next Goals: { $goal }
luo: Dwaro mar tich: { $goal }

source: Nias
luo: Dhonias

source: No
luo: ooyo

source: No gravatar found for your email
luo: Onge gravata moyud e barupi mar mbui

source: No information available
luo: Onge weche ma nitie

source: No microphone found.
luo: Ok oyudi gima mako duol.

source: Non-binary
luo: ma ok opogore

source: Northern Sotho
luo: Sotho ma Nyanduat

source: Norwegian Bokmål
luo: Dhonorwegia ma Bokmal

source: Norwegian Nynorsk
luo: Dhonorweyi

source: No sentences found!
luo: Onge weche moyudi

source: Note: You will still need to select between Speak or Listen to change contribution type.
luo: Yangi: Ibiro dwar ni iyier kar wuoyo kata ling mondo ilok wecheni misolo.

source: No Thanks
luo: Ooyo! Erokamano

source: No thanks, continue speaking
luo: Ok kamano , med wuoyo

source: No variant selected
luo: Onge kabind dhok moyier

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
luo: Sani koro inyalo chiwo duondi mondi ikonya gero kayakla mar duonde mangato angata nyalo tiyogo kendo yudo e yo mayot kaluwore gi riekni mosebiro kod teknologia. Som weche mondo ikony masinde punjoje kaka dhano wuoyo. Nonane kaka jokmoko osebedo ka chiwo duondegi mondo ine kinyanlo konyo. En gi mayot timo!

source: Number of Voices
luo: Kwan duonde

source: Numbers
luo: Kwan

source: Occitan
luo: Dhoositan

source: Odia
luo: Dhoodia

source: Off
luo: lor

source: Offensive Content
luo: Weche maok kare

source: Offensive language
luo: dhook maricho

source: Offensive speech
luo: Weche maricho

source: On
luo: nyime

source: Once logged in you can select your languages from the profile section.
luo: Kisedongo e kompiuta inyalo yiero dhok koa e kar picha mari.

source: One sentence per line
luo: Med wach achiel kachiel e laini

source: On his head he wore a beret.
luo: Oruako ogudu e wiye.

source: On iOS please continue with Safari to enable recording…
luo: Kitiyo kod iOS, yie idhi nyime kod Safari mondo iyaw mako duol...

source: Optionally join on our email list for updates and new information about the project.
luo: Kihero to inyalo donjo e barupwa mar mbui mondo iyudi weche manyien kuom chenroni.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
luo: Kihero to weche mawuoyo kuomi (kaka iki, chal mari ka in dichuo kata dhako, dhok miwacho, kod kit loso mari) ok bi ket ayanga e karatasi, to ok bitud gi akaunt mari e kwan mar weche. To duol ma ngato ochiwo ibiro tud kod weche mawuoyo kuome mana mondo okony tiegruok - kuom ranyisi, ngato nyalo dwaro loso teknologia mana matiyogi gimoro achiel.

source: Ossetian
luo: Dhoosetia

source: Other
luo: Mamoko

source: Other Language
luo: Dhok moro

source: Other people validate those voice clips.
luo: Jomoko puotho duonde momakigo

source: Other voice datasets…
luo: Deche mamoko mag duol...

source: Other Voice Datasets
luo: Deche mamoko mag duol

source: Our governance is founded on the pillars of:
luo: Lochwa ogur e sirni mag:

source: Our Partners
luo: Jowa mawariworego

source: Overall Accuracy
luo: Kaka Weche Duto Ochanre

source: Overall Hr. Total
luo: Seche duto koriu

source: Overall project status: see how far we’ve come!
luo: Chutho tich dhi nade nyaka newachaki: ne kuma waseae!

source: Papiamento (Aruba)
luo: Dhopapiamento ma Aruba

source: Partner
luo: Wat

source: Partners
luo: Jokanyakla

source: Partnerships
luo: Riuruok

source: Partnerships and networks
luo: Riuruok kod tudruok

source: Pashto
luo: Dhopasho

source: Past recordings download requests
luo: Kwayo golo duonde monosemaki

source: People come and contribute their voices.
luo: Ji biro to chiwo dwondegi kanyachiel

source: Persian
luo: Dhopasia

source: Personal
luo: Maga

source: <playIcon></playIcon>Last one!
luo: <playIcon></playIcon>Mogik!

source: Play/Stop
luo: Tugi/chung

source: Please add a source.
luo: Yie indik kuma igole wechegi.

source: Please add sentences.
luo: Kiyie to med weche

source: Please confirm that these sentences are public domain.
luo: Yie anena ni wechegi yudore ayanga ne jiduto.

source: Please select a language.
luo: Kiyie to yier dhok

source: Please try again.
luo: Tem kendo

source: Polish
luo: Dhopoland

source: Portuguese
luo: Dhoureno

source: Press play, listen & tell us: did they accurately speak the sentence below?
luo: Di tugo, chik iti kaeto inyiswa: Be wach moket piny kanyo osom maber?

source: Press { shortcut-play-toggle } to toggle play mode
luo: Di { shortcut-play-toggle } mondo ilok idhi kuma inyalo tugo

source: Privacy
luo: Weche ma ng'ato owuon

source: Privacy Policy
luo: Chike matayo weche ma ng'ato owuon

source: Privacy, security and transparency.
luo: Weche mag ngato owuon, rito kod ler mar weche.

source: Pro
luo: lony'

source: Profile
luo: Picha

source: Profile information improves the audio data used in training speech recognition accuracy.
luo: Weche michiwo mawuoyo kuomi koriwore gi deche duol momaki miyo teknoloji molosi mar ngeyo kit dunde ti maber.

source: Progress
luo: dhi nyime

source: Public Domain
luo: Aluora ma galamoro

source: Pular Guinea
luo: Dhopula ma Gini

source: Punctuation
luo: Ranyisi mag wach

source: Punjabi
luo: Dhopunjabi

source: Quechua Chanka
luo: Dhokwechua ma Chanka

source: Read More
luo: Som mangeny

source: Read more on our About page
luo: Som weche mamoko e migapwa

source: Read our How-to if unsure how to attribute
luo: Som ane kaka onengo tim kaok in kod adieri kaka inyal tud wechego gi wuongi.

source: Read the sentence carefully - don’t miss, change or add words.
luo: Som weche go duto maler - kik iwe moro amora kata kik imed wecheni iwuon.

source: Ready to add your voice or lend your ear?
luo: Iseikori medo duondi kendo miyowa iti?

source: Ready to contribute?
luo: Iseikri ne chiuruok?

source: Ready to do { $count } more?
luo: Useikoru timo { $count } moko?

source: Ready to donate your voice?
luo: Iseikri ne chiwo duondi?

source: Ready to help validate sentences?
luo: Iseikori konyo puodho weche?

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
luo: Yudo barupe mag mbui kuom gik modhiero kod parona dwaro, weche matuch kachiel gi weche mondiki manyien e Common Voice

source: Recorded Clips
luo: Duonde momaki

source: Recorded Hours
luo: Seche mosemaki

source: <recordIcon></recordIcon> Last one!
luo: <recordIcon></recordIcon> Ma e mogik!

source: Recordings
luo: Mak duonde

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
luo: Mako duod ji mawuoyo en achiel kuom gik mawatiyogo mondo wager dechwa moyangore; jomoko nyalo wacho ni bende enie mokelo mor timo.￼Type

source: Record/Stop
luo: Losi/Chung

source: Record your voice
luo: Mak duondi

source: Refresh
luo: Yaw Manyien

source: Reject
luo: Tamri

source: Rejected Sentences
luo: Weche motamruok

source: remove
luo: Gol

source: Remove
luo: gol

source: Remove Avatar
luo: Gol Avatar

source: Report
luo: Ripot/duoko

source: Report Bugs
luo: chiew duoko mag kudni

source: Report copyright issues
luo: Ful weche ma okop kamachielo

source: Report was passed successfully
luo: Oteno nokalo maber

source: Request a Language
luo: Kwa dhok

source: Request recordings
luo: kwayo duonde

source: *required
luo: *idwaro

source: Re-record
luo: Mak duol kendo

source: Re-record clip
luo: Nuo mako duol

source: Return
luo: Duogi

source: Return here to edit your goal anytime.
luo: Duog kae mondo ilos chenro mari mar tiyo saa asaya.

source: Return to Common Voice
luo: Dogi e Common Voice

source: Return to Languages
luo: Dogi e dhok moko

source: Review
luo: Non kendo

source: Review could not be saved. Please try again later.
luo: Weche mainonogo ok ne nyal kanore. Kiyie to tem kendo bange.

source: ⓘ Review Criteria
luo: Ngiyanena chenro

source: Reviewing Sentences
luo: Nono weche mosendiki

source: Review & re-record clips here as you go
luo: Non kendo kaeto ichak imak duolno kae kimedodhi

source: Review & re-record clips if needed
luo: Ngi kendo dual misemako kaeto ichaki mak duol kendo kaponi dwarore

source: Review sentences
luo: Non weche

source: Review Sentences
luo: Non weche

source: Review & Submit
luo: Non maber kaeto ior

source: Romanian
luo: Dhoromania

source: Romansh Sursilvan
luo: Dhoromans ma Susilvan

source: Romansh Vallader
luo: Dhoromans ma Valada

source: Runyankole
luo: Dhorunyankole

source: Russian
luo: dhorasia

source: Sakha
luo: Dhosaka

source: Santali (Ol Chiki)
luo: Dho joindia. ￼Type

source: Saraiki
luo: Dhosaraiki

source: Sardinian
luo: Dhosadini

source: Save
luo: Kan

source: Saved
luo: Mosekan

source: Scots
luo: Dhoskotland

source: Search
luo: Many

source: Search for answers
luo: Many duoko

source: Search for them on the Internet
luo: Manygi e mbui

source: See how your progress compares to other contributors all over the world.
luo: Ne kaka dongruok mari pimore kod oganda mamoko e piny ngima.

source: See Less
luo: Ne Matin

source: See More
luo: Ne moko

source: Select a Language...
luo: Yier dhok

source: Selected
luo: Moseyier

source: Select Language
luo: Yier dhok

source: Select the desired language dataset and choose the version you wish to download.
luo: Yier dhok dech duol midwaro kendo yier kabind dero midwaro golo.

source: Send sign up link
luo: Or tundruok mar donjo

source: Sentence
luo: Wach

source: Sentence Collection
luo: Choko weche

source: <sentenceCollectorFragment>See more on sentence collection</sentenceCollectorFragment>.
luo: <sentenceCollectorFragment>Ngi mangeny kuom choko weche</sentenceCollectorFragment>.

source: <sentenceCollectorVideo>Watch our guide on using the Sentence Collector</sentenceCollectorVideo>.
luo: <sentenceCollectorVideo>Ngii puonjruok marwa kaka itiyo kod gir choko weche</sentenceCollectorVideo>

source: Sentences
luo: Weche

source: { $sentences } added by you
luo: weche { $sentences } maimedo

source: Sentences are collected for people to read aloud.
luo: weche ichoko mondo ji osom matek

source: Sentence should not contain abbreviations
luo: weche mondiki ok onego oting alama mag wuoyo

source: Sentence should not contain numbers
luo: Weche ok oneg obed kod nembni

source: Sentence should not contain symbols
luo: Weche ok onego oting ranyisi

source: Sentences not submitted, are you sure you want to leave?
luo: Wechego ok o or, in kod adieri nidwaro wuok?

source: { $sentences } sentences reviewed. Thank you!
luo: weche { $sentences } mosenon. Erokamano!

source: Sentence text
luo: Ndiko mar wach

source: Serbian
luo: Dhosabia

source: Set a goal
luo: Ket chenro mar tiyo

source: Set my visibility
luo: Kaka anene

source: Setswana
luo: Dhosetswana

source: Settings
luo: chenro

source: Sex
luo: Chal - dhako kata dichuo

source: Sex or Gender
luo: Dhako kata dichuo

source: Share Common Voice
luo: Orne jomoko Common Voice

source: Share your clip
luo: Or duondi mimako

source: Shilha
luo: Dhoshiha

source: Shortcuts
luo: Ngado machiek

source: [Should be “We are”]
luo: [Onengo bedi "wan"]

source: Show my ranking
luo: Nyis ranginy mara

source: Sicilian
luo: Dhosisili

source: Sign up
luo: Ndikri piny

source: Sign up for an account
luo: Yaw akaont mamari iwuon

source: Sign up for Common Voice newsletters, goal reminders and progress updates
luo: Donjie Common Voice mondi iyud otegi mag oboke, inyal parni chenro mari mar tiyo kod kit dongruok.

source: sign up for email updates
luo: yaw barup mbui ma mari iwuon

source: Sign up for { $lang } updates:
luo: Kwayo bedo achiel kuom yudo weche { $lang } manyien

source: Sindhi
luo: Dhosindhi

source: Single Sentence
luo: Wach achiel

source: Single ZIP file containing
luo: Dero achiel motingo weche

source: Sinhala
luo: Dhosinhala
